using Microsoft.AspNetCore.Mvc;
using MovieManager.Models;

namespace MovieManager.Controllers
{
    public class MoviesController : Controller
    {
        public IActionResult Index()


        {
            //ذا اوبجكت  سويته من المودل عشان يجيب البيانات من المودل
            //لأن أسماء المتغيرات في C# تبدأ بحرف صغير.
            Movie movie2 = new Movie
            {
                Id = 313,
                Name = "Interstellar",
                Year = 2014,
                Rating = 9,


            };

            //اوبجكت ثاني طبعا الاوبجكت نفس خصائص الكلاس اللي سوناه بالمودل ولكن بقيم اخرى 
            Movie movie1 = new Movie
            {
                Id = 10,
                Name = "Obsession ",
                Year = 2026,
                Rating = 8,

            };
            //list ننشئها داخل الاندكس وتحديدا بعد الاوبجكت وقبل الريتيرن 

            //تقريبا هي زي الاوبجكت  اول تحط لست وبعدها تاخذ نوع الكلاس الللي تبي تسوي فيه قائمه وبعدها تسسميه انت 
            //Add() لا تُكتب داخل اللست الـ List. يعني بدون اقواس
            //أولًا أنشئ القائمة، ثم أضف العناصر إليها باستخدام Add().
            List<Movie> movies = new List<Movie>();
            //Add() هي Method(دالة) وظيفتها: إضافة عنصر واحد إلى الـ List.
            movies.Add(movie1);
            movies.Add(movie2);

            //الفور ايتش هي عباره عن اللوب كل شوي تتحقق  بالبداية تكتب اسم الكلاس وبعدها تعطيه اسم موقت زي تشيك وبعدعا ان وبعدها تحط القائمه اللي سويتها انت اللي هي الموفيز

            //استدعاء الميثود شو موفيز وإرسال قائمة الأفلام لها حتى تتمكن من استخدامها داخلها.
            //لأننا في الاستدعاء لا نكتب النوع، نكتب المتغير فقط.
            ShowMovies(movies);
            return View();

        }

        //فويد تعني أن الـ الميثود لا تُرجع قيمة, قيمه لليروتين).

        //الميثود تجمع الأوامر المتعلقة بوظيفة واحدة في مكان واحد، ثم أستدعيها وقت ما أحتاجهالأن وظيفتها عرض الأفلام
        //أن البيانات التي تستقبلها الميثود تكتب داخل()


        //داخل  تعريف الـ الميثود أكتب:النوع + اسم المتغير



        public void ShowMovies(List<Movie> allMovies)
        {
            //إذا كانت البيانات خارج الميثود، وأبي أستخدمها داخلها، لازم أرسلها للميثود عن طريق الـ الباراميتير.
            //استقبلت قائمة أفلام ثم استخدمت الفورايتش للمرور على كل فيلم داخل القائمة.
            //الميثود تستقبل لست موفي الللي هو الكلاس يصير كنوع واحد  ثم تتعامل مع كل الكلاس داخلها باستخدام فورايتش.
            foreach (Movie check in allMovies)
            {

                //في الفورايتش يكون عندي متغير مؤقت(مثل تشيك ) يمثل العنصر الحالي من القائمة.وللوصول إلى خصائص هذا العنصر أستخدم النقطة(.) مثل:
                if (check.Rating >= 9)
                {

                    //انت تبي تطبع الموفيز وعشان تطبعهم  تحط الاسم المؤقت اللي استخدمتع في الفورايتش وعشان توصل للخصائص الللي بالكلاس تحط نقطه وبعدها الخاصيه
                    Console.WriteLine("Excellent Movie");
                }

                else
                {
                    Console.WriteLine("Good Movie");
                }

            }


        }
}
}

